#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_cloudwatch_event_rule.aws_lambda_cost will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "aws_lambda_cost" {
        arn                 = "arn:aws:events:us-east-1:589845989135:rule/aws_lambda_cost"
      ~ description         = "Fires every five minutes" -> "Every 30 minutes"
        id                  = "aws_lambda_cost"
        is_enabled          = true
        name                = "aws_lambda_cost"
      ~ schedule_expression = "rate(5 minutes)" -> "rate(30 minutes)"
        tags                = {}
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
      ~ last_modified                  = "2020-02-29T10:18:25.841+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "IYmGX7dZTxnZGYGXA3MzixOnlc4uBRL/sCufVTSy6Wg=" -> (known after apply)
        source_code_size               = 887
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_POST_URL" = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-lambda-cost.null_resource.aws_lambda_cost must be replaced
-/+ resource "null_resource" "aws_lambda_cost" {
      ~ id       = "2344581849185106947" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "source_code_hash" = "caQDWfmsdbcR7o5a/cnv6xIMGkX+jLzr7Te7oU0uxvE=" -> "Bech0FcaKDYJFIWuTd2hduuWG7lEg75GeIRXQinNH6c="
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
